{
  "instructions": "Mix SPLENDA(R) Granulated Sweetener, chile garlic paste, light mayonnaise and ginger together in a medium mixing bowl. Stir well. Add soy sauce and rice vinegar. Mix until well blended.\nPour 1/4 cup of dressing in a small bowl. Place chicken breasts in bowl, tossing to coat. Marinate in refrigerator 45-60 minutes.\nPlace remaining dressing in a small saucepan. Set aside. Mix together cornstarch and water in a small bowl until cornstarch is dissolved. Pour cornstarch mixture into dressing while stirring constantly. Place pan on medium-high heat. Boil dressing over medium-high heat approx. 2 minutes, while stirring constantly. Remove dressing from heat and pour into a small bowl. Refrigerate at least 1 hour or until cool.\nRemove marinated chicken breasts from refrigerator. Grill or broil chicken until internal temperature reaches 160 degrees F. Set aside to cool. Slice thinly or shred cooled breasts. Cover and refrigerate until ready to use.\nPlace 1 bag (8 cups) of Asian Slaw in a straight-sided glass bowl. Drizzle a third of the prepared dressing over the slaw. Arrange 1/2 of the sliced or shredded chicken breasts and pea pods on top of the slaw mix.\nPour remaining slaw into bowl. Top with remaining chicken and oranges. Pour remaining dressing over the salad. Refrigerate until ready to serve.\nJust before serving top with chow mein noodles and green onion.",
  "ingredients": [
    "Dressing",
    "1/2 cup SPLENDA® No Calorie Sweetener, Granulated",
    "3 tablespoons Chinese chile garlic paste",
    "1/3 cup light mayonnaise",
    "1 tablespoon fresh ginger, minced",
    "1/4 cup light soy sauce",
    "3/4 cup rice vinegar",
    "1 3/4 teaspoons cornstarch",
    "1/3 cup water",
    "Salad",
    "4 boneless, skinless chicken breasts",
    "1 cup snow peas, trimmed and halved",
    "1 (15 ounce) can mandarin oranges, drained",
    "2 (12 ounce) packages Asian slaw mix",
    "Garnish",
    "2 cups chow mein noodles",
    "1/3 cup chopped green onion"
  ],
  "title": "Make Ahead Layered Chinese Chicken Salad",
  "image": "https://images.media-allrecipes.com/images/79591.png"
}