{
  "instructions": "Soak dal in 4 cups of water for at least 4 hours. Drain.\nCombine the soaked dal, 1 teaspoon chili powder, and 1 teaspoon ginger in a blender. Blend, adding 2 to 3 tablespoons water as needed, until well combined. Add salt and cumin seeds. Continue blending until dosa batter is the consistency of pancake batter.\nSaute celery, onions, and 1 tablespoon water in a skillet over medium-high heat until soft. Add mushrooms; cook until shrunk, about 5 minutes. Stir in spinach, yellow bell pepper, and frozen peas. Add salsa, cilantro, lemon juice, garlic, garam masala, coriander, 2 teaspoons chili powder, 2 teaspoons ginger, sea salt, seasoning salt, cinnamon, cumin seeds, and fennel seeds. Add cottage cheese. Reduce heat and let filling mixture simmer while making the dosas.\nPreheat a nonstick skillet over medium-high heat until a drop of water sizzles once it hits the surface. Pour 1/2 cup of batter over the center of the skillet and spread evenly with the back of a spoon. Swirl the spoon outward until dosa is 7 inches in diameter. Cook until dry on top, about 1 minute. Flip and cook until golden brown, about 1 minute more. Repeat with remaining batter.\nSpoon 3/4 cup of filling down the center of a dosa. Fold 1 side up and flip over so that both sides are tucked under. Repeat with remaining dosas.",
  "ingredients": [
    "Dosas:",
    "1 cup moong dal (split husked mung beans)",
    "1 teaspoon chili powder",
    "1 teaspoon minced ginger",
    "1/2 cup water, or as needed",
    "1/2 teaspoon salt",
    "1/2 teaspoon jeera (cumin seeds)",
    "Filling:",
    "3 stalks celery, finely chopped",
    "1 onion, chopped",
    "2 cups sliced cremini mushrooms",
    "1 (10 ounce) package frozen chopped spinach, thawed and drained",
    "1 yellow bell pepper, chopped",
    "1 cup frozen peas",
    "1 cup salsa",
    "1/2 cup chopped fresh cilantro",
    "2 tablespoons lemon juice",
    "2 tablespoons minced garlic",
    "2 tablespoons garam masala",
    "1 tablespoon ground coriander",
    "2 teaspoons chili powder",
    "2 teaspoons minced ginger",
    "1 teaspoon sea salt",
    "1 teaspoon seasoned salt",
    "1 teaspoon ground cinnamon",
    "1 teaspoon cumin seeds",
    "1 teaspoon fennel seeds",
    "1 cup cottage cheese"
  ],
  "title": "Mushroom Moong Dal Dosas",
  "image": "https://images.media-allrecipes.com/images/79591.png"
}