{
  "instructions": "MAKE THE FILLING: In a medium bowl, whisk the brown sugar with the cornstarch, salt and 1/2 cup of the half-and-half. Strain the half-and-half mixture through a fine sieve into a medium saucepan using a rubber spatula to press out any lumps of sugar. Whisk in the remaining 1 cup of half-and-half and the egg yolks. Cook the half-and-half mixture over moderate heat, stirring constantly with a heatproof rubber spatula, until it is thick and bubbling, about 7 minutes. Off the heat, whisk in the butter and the vanilla. Scrape the butterscotch pudding into a bowl and press a piece of plastic wrap directly onto the surface. Refrigerate the butterscotch pudding until chilled, at least 3 hours or overnight.\nMEANWHILE, MAKE THE CRUST: Preheat the oven to 350 degrees F. Butter a 9-inch glass pie plate and dust with bread crumbs, tapping out any excess. In a bowl, using an electric mixer, beat the egg yolks at high speed until thick and pale yellow, about 3 minutes. At medium speed, gradually beat in 6 tablespoons of the brown sugar, then beat at high speed until very thick, 5 minutes longer. Beat in the flour and vanilla.\nIn a large bowl, using clean beaters, beat the egg whites with a pinch of salt until soft peaks form. Add the remaining 2 tablespoons of brown sugar and beat at high speed until stiff and glossy, about 2 minutes. Using a rubber spatula, fold one-fourth of the egg whites into the yolk mixture, then fold the mixture into the remaining whites until no streaks remain. Spread the mixture in the pie plate and smooth the top. Bake about 20 minutes, until the souffle has risen and fallen slightly and is golden and springy to the touch. Turn off the oven and leave the crust in for 5 minutes. Transfer the crust to a rack to cool completely, about 30 minutes.\nFill the crust with the pudding. Refrigerate for at least 3 hours or overnight.\nMAKE THE TOPPING: Just before serving, in a medium bowl, beat the heavy cream with the confectioners' sugar and vanilla until firm. Spoon the cream over the pie and dust with cinnamon. Cut into wedges and serve.",
  "ingredients": [
    "FILLING",
    "2/3 cup packed dark brown sugar",
    "2 tablespoons cornstarch",
    "Pinch of salt",
    "1 1/2 cups half-and-half",
    "2 large egg yolks",
    "3 tablespoons unsalted butter, cut into tablespoons",
    "2 teaspoons pure vanilla extract",
    "CRUST",
    "Fine dry bread crumbs, for dusting",
    "4 large eggs, separated",
    "1/2 cup packed dark brown sugar",
    "2 tablespoons all-purpose flour",
    "1 teaspoon pure vanilla extract",
    "Pinch of salt",
    "TOPPING",
    "1 cup heavy cream",
    "1 1/2 tablespoons confectioners' sugar",
    "1 teaspoon pure vanilla extract",
    "Cinnamon, for sprinkling"
  ],
  "title": "Butterscotch Mousse Pie",
  "image": "https://images.media-allrecipes.com/images/79591.png"
}