{
  "instructions": "Preheat oven to 400 degrees F. Remove crusts from bread, and place slices in the bowl of a food processor. Process until fine crumbs form, about 10 seconds. Transfer breadcrumbs to a large mixing bowl. Do not substitute dried breadcrumbs in this step, as they will make your meatloaf rubbery.\nPlace carrot, celery, yellow onion, garlic, and parsley in the bowl of the food processor. Process until vegetables have been minced, about 30 seconds, stopping to scrape down the sides of the bowl once or twice. (Chopping vegetables this way saves time and ensures that vegetables will be small enough to cook through and not be crunchy). Transfer vegetables to bowl with the breadcrumbs.\nAdd 1/2 cup ketchup, 2 teaspoons dry mustard, pork, veal, beef, eggs, salt, pepper, Tabasco, and rosemary. Using your hands, knead the ingredients until thoroughly combined, about 1 minute. The texture should be wet, but tight enough to hold a free-form shape.\nSet a wire baking rack into an 11-by-17-inch baking pan. Cut a 5-by-11-inch piece of parchment paper, and place over center of rack to prevent meat loaf from falling through. Using your hands, form an elongated loaf covering the parchment.\nPlace the remaining 3 tablespoons ketchup, remaining 2 1/2 teaspoons mustard, and brown sugar in a bowl. Mix until smooth. Using a pastry brush, generously brush the glaze over loaf. Place oil in a medium saucepan set over high heat. When oil is smoking, add red onion. Cook, stirring occasionally, until onion is soft and golden in places. Add 3 tablespoons water, and cook, stirring, until most of the water has evaporated. Transfer onion to a bowl to cool slightly, then sprinkle onion over the meatloaf.\nBake 30 minutes, then sprinkle rosemary needles on top. Continue baking loaf until an instant-read thermometer inserted into the center of the loaf registers 160 , about 25 minutes more. Let meatloaf cool on rack, 15 minutes.",
  "ingredients": [
    "3 slices white bread",
    "1 large carrot, cut into 1/4-inch-thick rounds",
    "1 stalk celery, strings peeled, cut into 1/2-inch pieces",
    "1/2 medium yellow onion, roughly chopped",
    "2 cloves garlic, smashed and peeled",
    "1/2 cup fresh flat-leaf parsley leaves, loosely packed",
    "1/2 cup ketchup",
    "4 1/2 teaspoons dry mustard",
    "8 ounces ground pork",
    "8 ounces ground veal",
    "8 ounces ground round",
    "2 eggs, beaten",
    "2 teaspoons salt",
    "1 teaspoon freshly ground pepper",
    "1 teaspoon Tabasco sauce, or to taste",
    "1/2 teaspoon chopped fresh rosemary, plus more needles for sprinkling",
    "2 tablespoons dark brown sugar",
    "3 tablespoons ketchup",
    "1 tablespoon olive oil",
    "1 small red onion, cut into 1/4 inch-thick rings"
  ],
  "title": "All-American Meatloaf",
  "image": "https://images.media-allrecipes.com/userphotos/560x315/862423.jpg"
}