{
  "instructions": "In a large bowl, mix the flour, cornmeal, sugar, baking powder, and salt. In a separate bowl mix the eggs, milk, and 2 tablespoons vegetable oil; mix with dry ingredients just until moistened.\nHeat remaining 1 tablespoon oil in a large skillet over medium heat. Stir in onion and jalapenos, and cook until tender. Mix in BUSH'S(R) Black Beans, corn, 1 teaspoon chili powder, 1/2 teaspoon cumin and 1/3 cup of cilantro; mash slightly. Fold bean mixture and 1/2 the cheese into batter.\nIn an electric skillet or deep fryer, heat 1/4 inch oil for frying to 375 degrees F. Drop batter by rounded tablespoonfuls, a few at a time, into hot oil. Fry until golden brown, about 1 1/2 minutes on each side. Drain on paper towels.\nPreheat oven to 350 degrees F (175 degrees C). Lightly grease a medium baking dish. Transfer fritters to the prepared baking dish. Sprinkle with remaining cheese and olives.\nBake, covered, for 40 minutes. Uncover and bake for 15 to 20 minutes or until heated through and cheese is melted. Let stand for 5 minutes before serving.\nFor cilantro ranch dip: in a small bowl, mix dressing, sour cream, lime juice, 1 teaspoon of chili powder, 1/2 teaspoon of cumin, and 1 tablespoon of cilantro. Serve with fritters.",
  "ingredients": [
    "1 1/2 cups all-purpose flour",
    "1/2 cup cornmeal",
    "1 tablespoon white sugar",
    "2 teaspoons baking powder",
    "1 teaspoon salt",
    "2 eggs, lightly beaten",
    "1 cup milk",
    "3 tablespoons vegetable oil, divided",
    "1/3 cup finely chopped red onion",
    "2 fresh jalapeno peppers, seeded and diced",
    "1 (15 ounce) can BUSH'S® Black Beans, drained and rinsed",
    "1/2 cup frozen corn kernels",
    "1 teaspoon chili powder",
    "1/2 teaspoon ground cumin",
    "1/3 cup minced fresh cilantro",
    "1 cup shredded pepperjack cheese, divided",
    "1 quart oil for frying",
    "1 (2.25 ounce) can sliced black olives",
    "Cilantro Ranch Dip:",
    "1/2 cup Ranch-style salad dressing",
    "1/2 cup sour cream",
    "2 tablespoons lime juice",
    "1 teaspoon chili powder",
    "1/2 teaspoon ground cumin",
    "1 tablespoon minced fresh cilantro"
  ],
  "title": "BUSH'S® Spicy Black Bean Fritters with Cilantro Ranch Dip",
  "image": "https://images.media-allrecipes.com/userphotos/250x250/982776.jpg"
}