{
  "instructions": "Place 1/2 chopped onion, ginger, garlic, and 1/4 cup water into a blender and puree until smooth. Soak rice noodles in a bowl of lukewarm water for about 30 minutes.\nSeason chicken thigh meat lightly with salt and black pepper in a bowl and set aside. In a separate small bowl, whisk 1 cup of chicken broth into the chickpea flour. Reserve remaining 2 cups chicken broth for a later step.\nHeat vegetable oil in a skillet over medium-high heat. Stir in chicken pieces and cook, stirring frequently, until lightly browned. Remove the chicken pieces with a slotted spoon and set aside. Reduce heat to medium and add 1 1/2 sliced onions to the pan. Cook and stir until onion has softened and turned translucent, about 5 minutes. Reduce heat to medium-low and continue cooking and stirring until the onion is very tender and dark brown, 15 to 20 minutes more. Stir in the turmeric, paprika, and cayenne pepper.\nIn a medium stockpot, combine cooked chicken and any juices that have accumulated, browned onions, onion and ginger puree, and remaining 2 cups of chicken broth. Carefully add chickpea flour and broth mixture, stirring quickly so that the flour doesn't clump.\nBring the pot to a boil; reduce the heat to low and simmer, uncovered, for 15 minutes.\nStir in the coconut milk and cook just until heated through. Divide the soaked rice noodles among 5 large soup bowls. Ladle the soup over the rice noodles in the bowls and garnish each bowl with lemon wedges, green onions, hard-cooked eggs, cilantro, fish sauce, fried noodles, and curry powder.",
  "ingredients": [
    "1/2 onion, chopped",
    "1 (1 inch) piece fresh ginger root, peeled and chopped",
    "2 cloves garlic, chopped",
    "1/4 cup water",
    "1 (16 ounce) package rice noodles",
    "1 quart lukewarm water, or as needed to cover",
    "1 pound boneless, skinless chicken thighs, cut into 1/2 inch cubes",
    "salt and freshly ground black pepper to taste",
    "3 cups chicken broth, divided",
    "2 tablespoons chickpea flour",
    "2 tablespoons vegetable oil",
    "1 1/2 onions, halved and thinly sliced",
    "1/2 teaspoon ground turmeric",
    "2 teaspoons paprika",
    "1/2 teaspoon cayenne pepper",
    "1 cup coconut milk",
    "For Garnish:",
    "1 lemon, cut into wedges",
    "4 green onions, sliced on the bias, green and white parts",
    "2 hard-cooked eggs, sliced",
    "1 cup chopped fresh cilantro",
    "1 dash fish sauce, or to taste (optional)",
    "1 cup crispy fried rice noodles (optional)",
    "1 pinch curry powder, or to taste (optional)"
  ],
  "title": "Burmese Chicken-Coconut Soup (Ohn No Kyawswe)",
  "image": "https://images.media-allrecipes.com/userphotos/560x315/4406480.jpg"
}