{
  "instructions": "Melt butter in a large saucepan over medium-high heat. Stir in onion and garlic; cook until the onion has softened and the garlic has begun to turn brown, about 5 minutes. Stir in the celery and cook for 5 minutes. Add olive oil, Italian seasoning, parsley, bouillon cubes, and red wine; simmer for 5 minutes, stirring to break up the bouillon cubes. Stir in canned tomatoes, sugar, cayenne, and paprika. Bring to a boil, then reduce heat to medium-low and simmer for 10 minutes.\nTake the tomato sauce off of the heat and puree with a stick blender until smooth. Stir in the mixed seafood, and return to a boil over medium-high heat. Stir in squid, reduce heat to medium-low, and gently simmer for 30 minutes; season to taste with salt and pepper.\nWhile the tomato-seafood sauce is simmering, prepare the polenta by bringing water to a boil in a saucepan over medium heat. Reduce heat to medium, and slowly whisk in polenta with a wire whisk. Allow to simmer 5 minutes, whisking constantly. Stir in spinach, Parmesan cheese, and mozzarella cheese. Reduce heat to medium-low, and allow to slowly simmer 15 minutes, stirring frequently to keep from burning. Once the polenta has softened and turned creamy, remove from heat, season to taste with garlic salt, and keep warm.\nTo prepare the vegetable mix, heat 2 tablespoons olive oil in a large skillet over medium-high heat. Stir in red onion and cook for 2 minutes. Add zucchini and cook for an additional 2 minutes, or until zucchini begins to brown. Stir in mushrooms, and continue cooking until soft. Season with balsamic vinegar and salt and pepper to taste.\nTo serve, scoop a pile of polenta into the center of each plate; ladle the seafood sauce around, then top with vegetable mixture.",
  "ingredients": [
    "Tomato-Seafood Sauce:",
    "2 tablespoons butter",
    "1 onion, chopped",
    "3 cloves garlic, minced",
    "1 celery stalk, minced",
    "2 tablespoons olive oil",
    "1 tablespoon dried Italian seasoning",
    "2 tablespoons minced fresh parsley",
    "1 1/2 cubes fish-flavored bouillon cubes",
    "1 cup dry red wine",
    "3 cups canned diced tomatoes",
    "1 tablespoon white sugar",
    "1 pinch cayenne pepper",
    "1 pinch paprika",
    "1 pound mixed frozen seafood",
    "4 squid, cleaned and cut into rings and tentacles",
    "salt and pepper to taste",
    "Polenta:",
    "3 cups water",
    "1 cup coarse polenta (not instant)",
    "1/2 cup baby spinach leaves",
    "1/4 cup grated Parmesan cheese",
    "1/4 cup shredded mozzarella cheese",
    "garlic salt to taste",
    "Vegetable Mix:",
    "2 tablespoons olive oil",
    "1 small red onion, diced",
    "2 zucchini, cut in half lengthwise then into 1/4-inch slices",
    "10 cremini mushrooms, sliced",
    "1 tablespoon balsamic vinegar",
    "sea salt and pepper to taste"
  ],
  "title": "Polenta with Homemade Tomato-Seafood Sauce",
  "image": "https://images.media-allrecipes.com/images/79591.png"
}