{
  "instructions": "Make the Pastry: In a food processor, pulse the flour, sugar and salt. Add the butter; pulse until it resembles small peas. Sprinkle the water over the flour and pulse until moist crumbs form. Turn the pastry out onto a work surface; knead it with the heel of your hand 2 or 3 times. Flatten into a disk, wrap in plastic and refrigerate until chilled, at least 30 minutes. Let stand at room temperature for 15 minutes before rolling out.\nOn a lightly floured surface, roll the pastry out to a 13-inch round. Transfer the pastry to a 9-inch glass pie plate. Trim the overhang to 1 inch, then fold it under and crimp it decoratively. Using a fork, prick the bottom several times. Freeze the pastry until firm, about 1 hour or for up to 3 days.\nPreheat the oven to 425 degrees F. Line the pastry with parchment and fill with pie weights or dried beans. Bake in the lower third of the oven for 30 minutes, or until the rim is lightly browned and the bottom is just set. Remove the parchment and pie weights. Bake for 5 minutes longer, until cooked through and lightly browned. Cover the rim with foil if it begins to darken. Lower the oven to 350 degrees F.\nMeanwhile, Make the Filling: In a large bowl, whisk the pumpkin, sugar, cinnamon, ginger, nutmeg and salt. Whisk in the eggs, 1 at a time. Whisk in the cream and vanilla.\nPour the filling into the hot crust. Cover the rim with foil. Bake for 45 minutes, or until the custard is firm around the rim, slightly jiggly in the center. Transfer the pie to a baking sheet. Leave the oven on.\nMake the Meringue: In a bowl, beat the egg whites at medium speed until frothy. Add the cream of tartar and beat until soft peaks form. Slowly beat in the sugar. Add the vanilla. Increase the speed to medium-high; beat until stiff and glossy, about 2 minutes longer.\nScoop the meringue onto the warm pie, spreading and swirling it decoratively; be sure the meringue touches the crust all around. Bake the pie on the middle rack of the oven for 10 minutes, or until the meringue is lightly browned. Transfer the pie to a wire rack to cool completely, at least 4 hours. Decorate with Sugared Maple Leaves and serve.",
  "ingredients": [
    "Pastry:",
    "1 1/4 cups all-purpose flour",
    "1 teaspoon sugar",
    "1 teaspoon salt",
    "1/2 cup unsalted butter, cut into 1/2-inch pieces and chilled",
    "1/4 cup ice water",
    "Filling:",
    "1 (15 ounce) can solid-pack pumpkin",
    "3/4 cup sugar",
    "1 teaspoon cinnamon",
    "1 teaspoon ground ginger",
    "1/8 teaspoon freshly grated nutmeg",
    "1/8 teaspoon salt",
    "4 large eggs",
    "1 1/3 cups heavy cream",
    "1 teaspoon pure vanilla extract",
    "Meringue:",
    "4 large egg whites, at room temperature",
    "1 pinch cream of tartar",
    "1/2 cup superfine sugar",
    "1 teaspoon pure vanilla extract",
    "Sugared Maple Leaves (see Note)"
  ],
  "title": "Pumpkin Meringue Puff Pie",
  "image": "https://images.media-allrecipes.com/images/79591.png"
}