{
  "instructions": "In a 2- to 3-quart pan over high heat, bring 3 1/2 cups water and the rice to a boil. Reduce heat to medium-high and cook, uncovered, until most of the water is absorbed, 7 to 10 minutes. Turn heat to low, cover, and cook until rice is tender to bite, 10 to 15 minutes longer.\nMeanwhile, rinse pork and pat dry; cut into 3-inch-long strips 1 inch wide and 1/4 inch thick. In a small bowl, mix pork with 1 tablespoon soy sauce.\nPeel onion and cut lengthwise into 1/4-inch-wide slivers. Rinse, stem, and seed bell pepper; cut lengthwise into 1/4-inch-wide slivers about 3 inches long.\nDrain pineapple juice into a 1-cup glass measure. Add enough water to make 2/3 cup. Stir in remaining 1 tablespoon soy sauce, catsup, cornstarch, sugar, vinegar, and cayenne.\nPour 1/2 teaspoon oil into a 12-inch nonstick frying pan or 14-inch wok over high heat. When oil ripples when pan is tilted, add onion, bell pepper, ginger, and garlic. Stir often until bell pepper is tender-crisp to bite, 2 to 3 minutes. Pour from pan into a serving bowl.\nAdd remaining 1 teaspoon oil and the pork to pan; stir often until pork is no longer pink in the center (cut to test), 4 to 5 minutes. Return onion mixture to pan and add pineapple. Stir the pineapple juice mixture and add to pan. Stir until sauce boils and thickens, about 1 minute. Add salt to taste. Pour into a serving bowl and serve with hot cooked rice.",
  "ingredients": [
    "2 cups long-grain white rice",
    "1 pound fat-trimmed boned pork loin or sirloin (see notes)",
    "2 tablespoons soy sauce",
    "1 (8 ounce) onion",
    "1 (8 ounce) red or green bell pepper",
    "1 (8 ounce) can pineapple chunks in juice",
    "1/4 cup catsup",
    "1 tablespoon cornstarch",
    "1 tablespoon sugar",
    "1 tablespoon rice vinegar",
    "1/4 teaspoon cayenne (optional)",
    "1 1/2 teaspoons salad oil",
    "1 tablespoon minced fresh ginger",
    "1 tablespoon minced garlic",
    "Salt"
  ],
  "title": "Sweet and Sour Pork from Sunset's Kitchens",
  "image": "https://images.media-allrecipes.com/userphotos/250x250/986630.jpg"
}