{
  "instructions": "Heat oven to 375 degrees F. In 10-inch nonstick skillet, cook sausage over medium heat, stirring frequently, until thoroughly cooked. Drain; return sausage to skillet. Stir flour into sausage. Over medium heat, gradually add milk, cooking and stirring until bubbly and thickened. Stir in salt and 1/4 teaspoon of the pepper. Remove from heat; set aside.\nIn small bowl, beat eggs, half-and-half, parsley flakes, garlic salt and remaining 1/4 teaspoon pepper with wire whisk until well blended; set aside.\nIn another 10-inch nonstick skillet, melt 1/2 tablespoon of the butter over medium-high heat. Stir in potatoes. Cook about 5 minutes, stirring frequently, until lightly browned and almost fork-tender. Reduce heat to medium-low; stir remaining 1/2 tablespoon butter into potatoes. Pour egg mixture over potatoes; cook, folding potatoes into egg mixture, just until firm and moist. Remove from heat; set aside.\nSeparate dough into 8 biscuits; place each biscuit in ungreased 2 3/4x1 1/4-inch muffin cup. Firmly press dough in bottom and up side of each cup, forming 1/2-inch rim. Spoon potato mixture evenly into dough-lined cups. Spoon sausage mixture evenly over potato mixture (cups will be very full).\nBake at 375 degrees F for 17 to 22 minutes or until edges of biscuits are deep golden brown. Cool 5 minutes. Remove from muffin cups. If desired, garnish each with fresh parsley.",
  "ingredients": [
    "1/3 pound bulk pork sausage",
    "1 tablespoon all-purpose flour",
    "3/4 cup milk",
    "1/8 teaspoon salt",
    "1/2 teaspoon coarse ground black pepper",
    "2 eggs",
    "1 tablespoon half-and-half",
    "1/2 teaspoon dried parsley flakes",
    "1/8 teaspoon California-style garlic salt or garlic salt",
    "1 tablespoon butter or margarine",
    "1/2 cup frozen southern-style cubed hash-brown potatoes",
    "1 (16.3 ounce) can Pillsbury® Grands!® Homestyle Refrigerated Buttermilk Biscuits",
    "Fresh parsley (optional)"
  ],
  "title": "Sausage Breakfast Cups",
  "image": "https://images.media-allrecipes.com/images/79591.png"
}