{
  "instructions": "Combine 1/2 cup all-purpose flour and yeast in a bowl; stir in warm water. Let rest until doubled in volume, 30 to 40 minutes.\nHeat 1/2 cup milk in a small saucepan over medium heat until it begins to bubble. Combine milk, whole wheat flour, 1/4 cup sugar, 2 tablespoons butter, and 1/2 teaspoon salt in a bowl. Allow to cool slightly. Add yeast mixture; stir to combine.\nStir in additional all-purpose flour until dough forms a ball and pulls away from the bowl. Transfer to a floured work surface; knead until smooth and elastic. Place dough in a greased bowl; cover with plastic wrap and let rise until doubled in volume, 45 minutes to 1 hour.\nPunch dough down; let rest 10 minutes more.\nRoll dough out on a floured work surface into a 12x20-inch rectangle. Spread 2 tablespoons melted butter on the dough. Combine 1 cup confectioners' sugar, cocoa powder, and cinnamon in a bowl; sprinkle over the dough.\nPreheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.\nRoll dough up jelly-roll fashion. Shape roll into a circle on the prepared baking sheet. Slice roll into 16 slices, cutting only 3/4 of the way through. Twist every other slice flat to the inside of the circle; twist the other slices flat to the outside of the circle. Cover with plastic wrap; let rise until doubled in volume, about 30 minutes.\nBake in the preheated oven until golden, about 20 minutes. Remove from baking sheet; let cool.\nCombine 1 cup confectioners' sugar, 2 tablespoons milk, and 2 tablespoons melted butter. Drizzle glaze over coffee cake.",
  "ingredients": [
    "1 1/2 cups all-purpose flour, or as needed, divided",
    "1 (.25 ounce) package active dry yeast",
    "1/2 cup warm water",
    "1/2 cup milk",
    "1 cup whole wheat flour",
    "3/4 cup sugar",
    "2 tablespoons butter",
    "1/2 teaspoon salt",
    "2 tablespoons butter, melted",
    "1 cup confectioners' sugar",
    "1/4 cup dark cocoa powder",
    "1 teaspoon cinnamon",
    "Glaze:",
    "1 cup confectioners' sugar",
    "2 tablespoons milk",
    "2 tablespoons butter, melted"
  ],
  "title": "Glazed Chocolate Coffee Cake",
  "image": "https://images.media-allrecipes.com/images/79591.png"
}