{
  "instructions": "Bring water and rice to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until rice is tender and liquid has been absorbed, 20 to 25 minutes. Cover to keep warm.\nCombine olive oil and garlic in a large skillet over medium-low heat; cook and stir until fragrant, about 1 minute. Add red bell pepper; cook and stir until softened, about 5 minutes.\nStir refried beans, chili powder, cumin, 1/2 teaspoon salt, and pepper into the skillet. Increase heat to medium and cook until beans are heated through, about 5 minutes. Reduce heat to low; stir in 1/4 cup cilantro and a splash of lime juice. Cover and keep warm.\nSet out black olives, tomato, onion, and jalapeno pepper in small bowls, buffet style. Squeeze a little lime juice over each bowl; season with salt. Place yogurt, Cheddar cheese, and 1/4 cup cilantro in bowls alongside.\nHeat a large skillet over high heat. Cook each tortilla until lightly charred, about 30 seconds per side.\nSpread a spoonful of the refried bean mixture over each tortilla. Sprinkle Cheddar cheese on top to melt over the beans. Spread a spoonful of rice over the cheese. Layer yogurt, black olives, tomato, onion, jalapeno pepper, and cilantro on top. Fold in opposing edges of the tortilla and roll up to cover the filling.",
  "ingredients": [
    "2 cups water",
    "1 cup uncooked white rice",
    "Beans:",
    "2 tablespoons olive oil",
    "1 clove garlic, minced",
    "1/2 red bell pepper, finely chopped",
    "1 (16 ounce) can fat-free refried beans",
    "1 teaspoon chili powder",
    "1 teaspoon ground cumin",
    "1/2 teaspoon salt",
    "1/4 teaspoon ground black pepper",
    "1/4 cup chopped fresh cilantro",
    "1 splash lime juice",
    "Fixings:",
    "1/2 (6 ounce) can black olives, halved",
    "1/2 tomato, diced",
    "1/2 sweet onion, chopped",
    "1 jalapeno pepper, chopped",
    "1 lime, cut into wedges",
    "salt to taste",
    "1 cup plain fat-free Greek yogurt",
    "1/2 cup shredded Cheddar cheese, or to taste",
    "1/4 cup chopped fresh cilantro, or to taste",
    "4 (10 inch) flour tortillas"
  ],
  "title": "Vegetarian Burrito of Guiltless Gluttony",
  "image": "https://images.media-allrecipes.com/userphotos/560x315/4561720.jpg"
}