{
  "instructions": "Fill sink with ice water. In a stockpot, combine onion, carrot, bay leaves, garlic, ginger, zest, and peppercorns with 8 cups water; cover and bring to a boil. Add lobsters, cover, and cook 8 minutes once water has returned to a boil. Remove lobsters, reserving the liquid; transfer to the ice bath.\nWhen lobsters are cool enough to handle, break tails and claws from body; crack open to remove meat. Set meat aside. Add bodies and empty shells to reserved liquid; return to a boil. Reduce heat; simmer 30 minutes. Drain through a fine sieve; discard solids. Return liquid to pot; cook over medium-high heat until reduced to 1 cup, about 45 minutes. Cut meat from lobster-tail and claw into bite-size pieces; set aside.\nBring a 5-quart saucepan of salted water to a boil, and cook pasta until al dente, about 7 minutes. Drain in a colander, and set aside.\nCut onion into 1/8-inch wedges; remove the core. Cut zucchini lengthwise into quarters and crosswise into 1/2-inch pieces. Heat a low-sided 6-quart saucepan coated with olive-oil cooking spray over medium-high heat until very hot. Add onion and garlic; reduce heat to medium low. Cook until onions are translucent, about 3 minutes. Add zucchini; cook until tender, about 7 minutes. Add corn, reserved lobster meat, cooked pasta, reserved liquid, arugula, and marjoram; stir to combine. Stir in Parmesan, if desired; serve.",
  "ingredients": [
    "1 onion, quartered",
    "1 carrot, peeled and cut into 1 inch pieces",
    "3 bay leaves",
    "1 garlic clove, peeled and smashed",
    "1 (1 inch) piece fresh ginger, sliced",
    "orange, zested",
    "1 tablespoon whole black peppercorns",
    "2 (1 1/4 pound) live lobsters",
    "Salt",
    "8 ounces penne or garganelli",
    "1 Vidalia or other sweet onion",
    "1 pound small zucchini",
    "2 tablespoons minced garlic",
    "4 ears corn, shaved from the cob",
    "2 bunches arugula, stems trimmed, chopped",
    "2 tablespoons fresh marjoram leaves",
    "1 ounce freshly grated Parmesan cheese (optional)",
    "Olive oil cooking spray"
  ],
  "title": "Penne with Lobster Corn and Arugula",
  "image": "https://images.media-allrecipes.com/images/79591.png"
}