{
  "instructions": "In a medium mixing bowl, combine ground cinnamon, 2 teaspoons cumin, 1 teaspoon coriander, 1 tablespoon fresh ginger, flour, 1/2 teaspoon salt, and 1/4 teaspoon pepper. Toss lamb pieces with the spice mixture to coat.\nIn a Dutch oven or a large saucepan, heat 2 tablespoons olive oil over medium-high heat. Add lamb in two to three batches, in a single layer, and sear until dark brown on all sides, about 6 minutes per batch. Add the remaining tablespoon olive oil during searing if pan becomes dry. Remove the lamb pieces, and set aside.\nReduce heat to medium; add 1 tablespoon butter. Add onions and sugar; cook 10 minutes, stirring frequently, scraping up brown bits on bottom of pan while stirring the onion.\nReduce heat to medium low, add minced garlic, and cook until brown and well caramelized, about 15 minutes.\nPreheat oven to 325 degrees F. Stir in stock, tomatoes, star anise, cinnamon sticks, carrots, remaining 2 teaspoons cumin, 2 teaspoons coriander, 1 tablespoon ginger, remaining 1 teaspoon salt, and reserved lamb. Bring to a boil, reduce heat to medium, and simmer, stirring occasionally, uncovered, for about 1 hour, until lamb is tender and sauce is thick.\nMeanwhile, place sweet potatoes in a large saucepan; cover with cold water. Bring to a boil, reduce heat to medium, and simmer, uncovered, for 15 minutes, until very tender when pierced with a fork. Drain potatoes, and return to saucepan. Dry potatoes over medium-low heat for 1 minute. Pass potatoes through a food mill into a medium bowl. Stir in remaining 3 tablespoons butter; add salt to taste. Set aside, loosely covered.\nIf using spinach, place in a large skillet over medium-high heat. Season to taste with salt and pepper, cover, and cook until wilted, about 1 1/2 minutes. Drain, and rinse under cold water to stop the cooking. Set aside.\nRemove star anise and cinnamon sticks from the stew. Stir in cherries and prunes. Transfer mixture to a deep 2-quart casserole, and place a layer of spinach, if using, over the stew. Spoon the sweet potato mixture onto the stew. Place on a baking sheet, and bake for 30 minutes. Sprinkle with freshly grated nutmeg.",
  "ingredients": [
    "2 teaspoons ground cinnamon",
    "4 teaspoons ground cumin",
    "3 teaspoons ground coriander",
    "2 tablespoons freshly grated ginger",
    "1 tablespoon all-purpose flour",
    "1 1/2 teaspoons salt, plus more to taste",
    "1/4 teaspoon freshly ground black pepper plus more to taste",
    "2 pounds lean leg of lamb, cut into 1-inch cubes",
    "3 tablespoons olive oil",
    "4 tablespoons unsalted butter",
    "4 large onions, thinly sliced",
    "1 tablespoon sugar",
    "3 large cloves garlic, peeled and minced",
    "3 cups homemade beef stock",
    "1 (28 ounce) can whole Italian plum tomatoes",
    "2 pieces star anise",
    "2 (3 inch) cinnamon sticks",
    "2 medium carrots, peeled and cut into 1/2-inch rounds",
    "2 pounds sweet potatoes, peeled and cubed",
    "12 ounces fresh spinach, washed (optional)",
    "1/2 cup dried tart cherries",
    "1/2 cup dried pitted prunes, cut in half",
    "Freshly grated nutmeg for sprinkling"
  ],
  "title": "Lamb and Sweet Potato Pie",
  "image": "https://images.media-allrecipes.com/images/79591.png"
}