{
  "instructions": "In a large, deep-sided skillet, bring the water to a boil with the sugar and white vinegar. Cook for 1 minute, stirring frequently, until the sugar dissolves.\nIn a small bowl, whisk the soy sauce, ketchup and sesame oil until smooth. Whisk the soy sauce mixture into the vinegar mixture. Bring the sauce to a boil and cook, stirring occasionally, until syrupy, about 5 to 7 minutes, then lower the heat to a simmer.\nSeason both sides of the pork slices with salt and pepper. Pour the rice wine into a bowl and dredge the pork in the wine. In a shallow bowl, mix the flour and cornstarch until evenly combined. Dredge the pork in the flour mixture, shaking off any excess.\nIn a wok or large deep-sided skillet, heat the peanut oil until it reaches 350 degrees on a deep-frying thermometer, or until a pork slice sizzles and rapidly rises to the top when placed in the oil. When the oil is ready, carefully add 2 pork slices to it, using tongs. (Stand back from the stove when lowering the pork into the hot oil.) Fry the slices for 1 minute, then remove the pork to a paper towel-lined plate. Repeat with the remaining pork.\nAllow the oil to reheat for 2 minutes, then quickly refry the pork slices, 2 at a time, for 1 more minute, and drain on fresh paper towels. The slices should be crisp and golden on the outside, tender and cooked throughout.\nTransfer the cooked pork slices to the pan of simmering sweet-and-sour sauce, turning them until they are well coated. Remove the pork to a serving plate. Garnish with cilantro and serve with rice.",
  "ingredients": [
    "1 1/2 cups water",
    "2 cups granulated sugar",
    "1 cup distilled white vinegar",
    "1/4 cup light soy sauce",
    "1/4 cup ketchup",
    "1/4 teaspoon toasted sesame oil",
    "2 pounds boneless pork loin, cut into 1/4-inch slices",
    "Salt and freshly ground pepper",
    "2 tablespoons Chinese rice wine, Sherry or brandy",
    "2/3 cup all-purpose flour",
    "2/3 cup cornstarch",
    "4 cups peanut oil",
    "Cilantro leaves, for garnish",
    "Steamed rice, for serving"
  ],
  "title": "Peking Pork with Sweet and Sour Sauce",
  "image": "https://images.media-allrecipes.com/userphotos/250x250/993416.jpg"
}