{
  "instructions": "Preheat the broiler. Toast half of the bread slices at a time on a baking sheet. Rub both sides of the toast with the cut garlic and drizzle 1/2 cup EVOO over the slices.\nWhile the bread is working, in a large skillet, heat the remaining 3 tablespoons EVOO, 3 turns of the pan, over medium-high heat. Add the onion and bell pepper and cook until slightly softened, 2 to 3 minutes. Add the broccoli florets and chicken broth and bring to a simmer. Cover the pan and cook until the broccoli is tender, about 8 minutes. Uncover and boil until the liquid evaporates, 1 to 2 minutes. Season to taste with salt and pepper.\nIn a medium saucepan, melt the butter over medium heat. Whisk in the flour and cook for 1 minute. Whisk in the milk, bring to a boil, then lower the heat and simmer, stirring often, until thick and smooth, about 5 minutes. Season the sauce with salt, pepper and the nutmeg.\nPreheat the oven to 450 degrees F. Layer half of the bread in a 9-by-13-inch casserole; spread with half of the broccoli mixture and top with the ricotta, a few ladles of the sauce and the Parmigiano-Reggiano. Layer the remaining bread slices, broccoli mixture, remaining sauce and all of the provolone cheese on top. Bake until brown and bubbling, 10 to 15 minutes.",
  "ingredients": [
    "1 large loaf semolina bread, sliced 1/2 inch thick",
    "4 large cloves garlic, peeled and halved",
    "1/2 cup extra-virgin olive oil (EVOO)",
    "3 tablespoons extra-virgin olive oil (EVOO)",
    "1 large onion - peeled, halved and thinly sliced",
    "1 red bell pepper, seeded and thinly sliced",
    "2 large heads broccoli, trimmed and cut into small florets",
    "1 cup chicken broth",
    "Salt and freshly ground pepper",
    "3 tablespoons butter",
    "3 tablespoons flour",
    "3 cups milk",
    "1/2 teaspoon ground nutmeg",
    "2 cups ricotta cheese",
    "1 cup grated Parmigiano-Reggiano cheese",
    "2 cups shredded provolone or Asiago cheese"
  ],
  "title": "Broccoli Breadzagna",
  "image": "https://images.media-allrecipes.com/images/79591.png"
}