{
  "instructions": "Set oven to 150 degrees F. Prepare the bearnaise sauce, and keep in a 150 degrees F oven. That recipe will make more than you'll need here but make the full batch anyway. You just may want a little extra.\nRemove the meat from the crab legs and carefully cut or tear into bite-sized pieces. Place in a bowl, cover with aluminum foil and place in the warm oven.\nArrange asparagus spears on a microwave safe plate with 1 Tbsp water. Tightly cover with plastic wrap pierced with a knife (one small hole is fine). Zap for 3 minutes then transfer to the oven.\nDepending on the veal cutlets, they may be two thick steaks or 4 thinner ones. Either way is fine. This recipe assumes the thick cutlets. If using the thin ones, reduce the braising time to 3 minutes.\nSeason the veal cutlets on both sides with salt and pepper.\nIn a skillet over medium-high heat, melt the butter. Add the cutlets and sear both sides (2-3 minutes per side). Transfer to a plate. Add the sherry and cook about 30 seconds then add the stock. Bring to a boil as you scrape up any brown bits. Reduce heat to a simmer. Add the cutlets, loosely covered with lid or foil and braise for 5 minutes. Remove from heat and uncover.\nRecommended plating: Arrange the asparagus spears just off center of the plate with 3 spears pointing one way and 3 pointing the opposite direction. It is great if you can get them to stack. Then lean the veal cutlet(s) against the asparagus. Sprinkle the crab meat over the veal and asparagus. Drizzle the bearnaise sauce over the veal and asparagus in a zigzag fashion perpendicular to the direction of the asparagus. Sprinkle the paprika and chives around the edge of the plate. Serve at once.\nEnjoy your special occasion, whatever it is!",
  "ingredients": [
    "1/2 cup Bearnaise Sauce",
    "1/2 pound Alaskan king crab legs",
    "12 asparagus spears",
    "12 ounces veal cutlets",
    "salt and pepper",
    "1 tablespoon butter",
    "1/2 cup veal stock or chicken stock",
    "1 tablespoon dry sherry",
    "1 teaspoon paprika, as garnish",
    "2 teaspoons fresh chives, minced, as garnish"
  ],
  "title": "Veal Oscar",
  "image": "https://images.media-allrecipes.com/images/79591.png"
}